Catalogs/АС_Метаданные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>АС_Метаданные</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АС_ВидОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АС_Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АС_Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АС_Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АС_Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АС_Объекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АС_Метаданные/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаЗаполнитьНаСервере()
		Объект.АС_Объекты.Очистить(); 
	
	Для Каждого Метаданное Из Метаданные.Справочники Цикл 
		НовСтрока = Объект.АС_Объекты.Добавить();
		НовСтрока.АС_Имя 		= Метаданное.Имя;
		НовСтрока.АС_Синоним 	= Метаданное.Синоним;  
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	Объект.НазваниеВерсияКонфигурации =  Метаданные.КраткаяИнформация + " " + Метаданные.Версия;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры
